#+TITLE: Executable scripts
#+setupfile: headers
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak’s custom scripts" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak’s custom scripts" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Source code of Phundrak’s custom scripts" />
#+PROPERTY: header-args :exports code
#+PROPERTY: header-args:emacs-lisp :exports none :tangle no

**** Setting default values
:PROPERTIES:
:CUSTOM_ID: ytdl-a-youtube-dl-wrapper-Setting-default-values-da404639
:END:
Some variables in this script will have default values, we do not want to have a
mile-long command each time we wish to download a single video. We’ll also set
some global variables that won’t change:
#+NAME: ytdl-default-vars
| Variable Name    | Default Value                                             | String? |
|------------------+-----------------------------------------------------------+---------|
| YTDL_SHARED_DIR  | $HOME/.local/share/ytdl                                   | no      |
| FORMAT_DEFAULT   | %(uploader)s/%(upload_date)s - %(title)s.%(ext)s          | yes     |
| DOWNFILE_DEFAULT | $YTDL_SHARED_DIR/downloaded                               | no      |
| ERRFILE_DEFAULT  | $YTDL_SHARED_DIR/video-errors                             | no      |
| LOGFILE_DEFAULT  | $YTDL_SHARED_DIR/ytdl.log                                 | no      |
| PREFFERED_FORMAT | bestvideo[ext=mp4]+bestaudio[ext=m4a]/bestvideo+bestaudio | yes     |
| VERSION          | 0.3                                                       | yes     |

There is one more default variable pointing to ytdl’s root directory which
depends on whether the videos directory has a French or English name:
#+NAME: ytdl-default-vars-root
#+BEGIN_SRC fish :tangle no
if test -d "$HOME/Vidéos"
    set -g ROOTDIR_DEFAULT "$HOME/Vidéos" # French name
else
    set -g ROOTDIR_DEFAULT "$HOME/Videos" # English name
end
#+END_SRC

#+NAME: ytdl-default-vars-make
#+BEGIN_SRC emacs-lisp :var vars=ytdl-default-vars
(mapconcat (lambda (var)
             (let ((varname  (car  var))
                   (varvalue (cadr var))
                   (string?  (string= (nth 2 var) "yes")))
               (format "set -g %-16s %s" varname (if string? (format "\"%s\"" varvalue)
                                                 varvalue))))
           vars
           "\n")
#+END_SRC

#+RESULTS: ytdl-default-vars-make
: set -g YTDL_SHARED_DIR  $HOME/.local/share/ytdl
: set -g FORMAT_DEFAULT   "%(uploader)s/%(upload_date)s - %(title)s.%(ext)s"
: set -g DOWNFILE_DEFAULT $YTDL_SHARED_DIR/downloaded
: set -g ERRFILE_DEFAULT  $YTDL_SHARED_DIR/video-errors
: set -g LOGFILE_DEFAULT  $YTDL_SHARED_DIR/ytdl.log
: set -g PREFFERED_FORMAT "bestvideo[ext=mp4]+bestaudio[ext=m4a]/bestvideo+bestaudio"
: set -g VERSION          "0.3"

#+BEGIN_SRC fish :noweb yes
<<ytdl-default-vars-make()>>
<<ytdl-default-vars-root>>
#+END_SRC

We’ll also create the directory pointed at by ~YTDL_SHARED_DIR~ if it doesn’t
exist already:
#+BEGIN_SRC fish
mkdir -p $YTDL_SHARED_DIR
#+END_SRC

**** Arguments Handling
:PROPERTIES:
:CUSTOM_ID: ytdl-a-youtube-dl-wrapper-Arguments-Handling-1daebbe8
:END:
The function ~_ytdl_parse_ops~ is a little bit trickier: we use ~getopts~ to
parse the arguments passed to the script in order to get some preferences from
the user. Here is a quick reference on what options are available and what they
do:
#+NAME: ytdl-table-arguments
| Short | Long       | Takes a value? | Associated Variable | Default Value     | What it does         |
|-------+------------+----------------+---------------------+-------------------+----------------------|
| 4     | ipv4       | no             | IPV4                | None              | Force IPv4           |
| 6     | ipv6       | no             | IPV6                | None              | Force IPv6           |
| a     | batch-file | yes            | FILE                | None              | Batch file           |
| c     | cache      | yes            | DOWNFILE            | $DOWNFILE_DEFAULT | Cache file           |
| d     | directory  | yes            | ROOTDIR             | $ROOTDIR_DEFAULT  | Root directory       |
| e     | error-file | yes            | ERRFILE             | $ERRFILE_DEFAULT  | Error logs           |
| f     | format     | yes            | FORMAT              | $FORMAT_DEFAULT   | Filename format      |
| l     | logs       | yes            | LOGFILE             | $LOGFILE_DEFAULT  | Logs                 |
| V     | verbose    | no             | VERBOSE             | 1                 | Verbose output       |
| v     | version    | command        | None                | None              | Script version       |
| h     | help       | command        | None                | None              | Display this message |

We can also pass individual YouTube URLs without any options or switches
associated to them, they will be downloaded as part of a single queue.

#+NAME: ytdl-arg-handling-gen
#+BEGIN_SRC emacs-lisp :var args=ytdl-table-arguments
(mapconcat (lambda (arg)
             (let* ((short (format "%s" (nth 0 arg)))
                    (long  (nth 1 arg))
                    (arg?  (string= "yes" (nth 2 arg)))
                    (var   (unless (string= "None" (nth 3 arg))
                             (nth 3 arg))))
               (format "case %s %s\n\t%s"
                       short long
                       (if var (format "set -g %s %s" var
                                       (if arg? "$value" ""))
                         (format "_ytdl_%s && exit"
                                 (if (string= "h" short) "help" "version"))))))
           args
           "\n")
#+END_SRC

#+RESULTS: ytdl-arg-handling-gen
#+begin_example
case 4 ipv4
        set -g IPV4
case 6 ipv6
        set -g IPV6
case a batch-file
        set -g FILE $value
case c cache
        set -g DOWNFILE $value
case d directory
        set -g ROOTDIR $value
case e error-file
        set -g ERRFILE $value
case f format
        set -g FORMAT $value
case l logs
        set -g LOGFILE $value
case V verbose
        set -g VERBOSE
case v version
        _ytdl_version && exit
case h help
        _ytdl_help && exit
#+end_example

The following shows how ~getopts~ is used to catch the options and switches
passed to the script:
#+NAME: ytdl-getopts
#+BEGIN_SRC fish :noweb yes :tangle no
getopts $argv | while read -l key value
    switch $key
        <<ytdl-arg-handling-gen()>>
        case _
            for v in $value
                set -g VIDEOS $VIDEOS $v
            end
    end
end
#+END_SRC

#+NAME: ytdl-arg-set-default-value-gen
#+BEGIN_SRC emacs-lisp :var args=ytdl-table-arguments
(let* ((args (seq-filter (lambda (arg)
                           (let* ((var     (unless (string= "None" (nth 3 arg)) (nth 3 arg)))
                                  (default (format "%s" (nth 4 arg)))
                                  (default (unless (string= "None" default) default)))
                             (and var default)))
                         args)))
  (mapconcat (lambda (arg)
               (let* ((var     (nth 3 arg))
                      (default (format "%s" (nth 4 arg))))
                 (format "if set -q $%s\n\tset -g %s %s\nend"
                         var var default)))
             args
             "\n"))
#+END_SRC

#+RESULTS: ytdl-arg-set-default-value-gen
#+begin_example
if set -q $DOWNFILE
        set -g DOWNFILE $DOWNFILE_DEFAULT
end
if set -q $ROOTDIR
        set -g ROOTDIR $ROOTDIR_DEFAULT
end
if set -q $ERRFILE
        set -g ERRFILE $ERRFILE_DEFAULT
end
if set -q $FORMAT
        set -g FORMAT $FORMAT_DEFAULT
end
if set -q $LOGFILE
        set -g LOGFILE $LOGFILE_DEFAULT
end
if set -q $VERBOSE
        set -g VERBOSE 1
end
#+end_example

Some values need to be set to their default, so let’s assign them their value if
no user value was passed:
#+NAME: ytdl-arg-set-default-value
#+BEGIN_SRC fish :noweb yes :tangle no
<<ytdl-arg-set-default-value-gen()>>
set -g FORMAT "$ROOTDIR/$FORMAT"
#+END_SRC

Both these code blocks are executed in ~_ytdl_parse_ops~:
#+BEGIN_SRC fish :noweb yes
function _ytdl_parse_ops
    <<ytdl-getopts>>
    <<ytdl-arg-set-default-value>>
end
#+END_SRC

